* LEET CODE

** 1. Number of Steps to Reduce a Number to Zero                :EASY:PYTHON:
   :LOGBOOK:
   CLOCK: [2020-07-09 Thu 15:52]--[2020-07-09 Thu 16:06] =>  0:14
   :END:
  - link: https://leetcode.com/problems/number-of-steps-to-reduce-a-number-to-zero/ 

** 2. How Many Numbers Are Smaller Than the Current Number      :EASY:PYTHON:
   :LOGBOOK:
   CLOCK: [2020-07-09 Thu 16:07]--[2020-07-09 Thu 16:20] =>  0:13
   :END:
  - link: https://leetcode.com/problems/how-many-numbers-are-smaller-than-the-current-number/
    
** 3. Decompress Run-Length Encoded List                        :EASY:PYTHON:
   :LOGBOOK:
   CLOCK: [2020-07-10 Fri 16:16]--[2020-07-10 Fri 16:42] =>  0:26
   CLOCK: [2020-07-10 Fri 16:14]--[2020-07-10 Fri 16:15] =>  0:01
   :END:
   - link: https://leetcode.com/problems/decompress-run-length-encoded-list/

** 4. Subtract the Product and Sum of Digits of an Integer      :EASY:PYTHON:
   :LOGBOOK:
   CLOCK: [2020-07-10 Fri 16:45]--[2020-07-10 Fri 17:02] =>  0:17
   :END:
   - link: https://leetcode.com/problems/subtract-the-product-and-sum-of-digits-of-an-integer/

** 5. Create Target Array in the Given Order                    :EASY:PYTHON:
   :LOGBOOK:
   CLOCK: [2020-07-10 Fri 17:10]--[2020-07-10 Fri 17:29] =>  0:19
   :END:
   - link: https://leetcode.com/problems/create-target-array-in-the-given-order/

** 6. Split a String in Balanced Strings                        :EASY:PYTHON:
  :LOGBOOK:
  CLOCK: [2020-07-10 Fri 17:49]--[2020-07-10 Fri 18:00] =>  0:11
  :END:
  - link: https://leetcode.com/problems/split-a-string-in-balanced-strings/

** 7. Find Numbers with Even Number of Digits                   :EASY:PYTHON:
   :LOGBOOK:
   CLOCK: [2020-07-10 Fri 23:44]--[2020-07-10 Fri 23:50] =>  0:06
   :END:
   - link: https://leetcode.com/problems/find-numbers-with-even-number-of-digits/

** 8. Reformat Department Table                                    :EASY:SQL:
   :LOGBOOK:
   CLOCK: [2020-07-12 Sun 16:28]--[2020-07-12 Sun 16:40] =>  0:12
   :END:
   - link: https://leetcode.com/problems/reformat-department-table/
   - convert row into column
   - sum(if(month = "Jan", revenue, NULL)) as Jan_Revenue
** 9. Minimum Time Visiting All Points                          :EASY:PYTHON:
   :LOGBOOK:
   CLOCK: [2020-07-12 Sun 22:46]--[2020-07-12 Sun 23:04] =>  0:18
   :END:
   - link: https://leetcode.com/problems/minimum-time-visiting-all-points/
** 10. Running Sum of 1d Array                                  :EASY:PYTHON:
   :LOGBOOK:
   CLOCK: [2020-07-12 Sun 23:07]--[2020-07-12 Sun 23:19] =>  0:12
   :END:
   - link: https://leetcode.com/problems/running-sum-of-1d-array/
** 11. Number of Students Doing Homework at a Given Time        :EASY:PYTHON:
   :LOGBOOK:
   CLOCK: [2020-07-12 Sun 23:23]--[2020-07-12 Sun 23:35] =>  0:12
   :END:
   - link: https://leetcode.com/problems/number-of-students-doing-homework-at-a-given-time/
** 12. Number of Days Between Two Dates                         :EASY:PYTHON:
   :LOGBOOK:
   CLOCK: [2020-07-12 Sun 23:39]--[2020-07-12 Sun 23:47] =>  0:08
   :END:
   - link: https://leetcode.com/problems/number-of-days-between-two-dates/
** 13. Assign Cookies                                  :EASY:PYTHON:BELOW50%:
   :LOGBOOK:
   CLOCK: [2020-07-13 Mon 22:09]--[2020-07-13 Mon 23:05] =>  0:56
   :END:
   - link: https://leetcode.com/problems/assign-cookies/
** 14. Kth Largest Element in a Stream                 :EASY:PYTHON:BELOW50%:
   :LOGBOOK:
   CLOCK: [2020-07-13 Mon 23:10]--[2020-07-13 Mon 23:39] =>  0:29
   :END:
   - link: https://leetcode.com/problems/kth-largest-element-in-a-stream/

Can you see this ?
